In [8]:
pip install pandas

Requirement already satisfied: pandas in c:\users\h\appdata\local\programs\python\python311\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.23.2 in c:\users\h\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.2.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\h\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\h\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\h\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\h\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.3.1 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [9]:
#IMPORT LIBRARY
import pandas as pd

In [10]:
#Empty df
df=pd.DataFrame();
df

Empty DataFrame
Columns: []
Index: []

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 0 entries
Empty DataFrame

In [13]:
#list to conver dataFrame
city=['Berlin','munich','studgratt'];
df=pd.DataFrame(city)

In [15]:
df

           0
0     Berlin
1     munich
2  studgratt

In [16]:
type(df)

pandas.core.frame.DataFrame

In [20]:
row, col = df.shape

In [21]:
row

3

In [22]:
col

1

In [23]:
df.shape

(3, 1)

In [24]:
df

           0
0     Berlin
1     munich
2  studgratt

In [25]:
#set columns name 
df=pd.DataFrame(city,columns=['City_in_Germany'])

In [26]:
df

  City_in_Germany
0          Berlin
1          munich
2       studgratt

In [27]:
#set rows name 
df=pd.DataFrame(city,columns=['City_in_Germany'],index=['c1','c2','c3'])

In [28]:
df

   City_in_Germany
c1          Berlin
c2          munich
c3       studgratt

In [29]:
city2=['Dortmund','paris','Postdam']
df2=pd.DataFrame(zip(city,city2),columns=['city1','city2'])

In [30]:
df2

       city1     city2
0     Berlin  Dortmund
1     munich     paris
2  studgratt   Postdam

In [31]:
df2.shape

(3, 2)

In [32]:
city3=[['Bavaria','Erlangen'],['NRW','Dortmund']]

In [33]:
city3

[['Bavaria', 'Erlangen'], ['NRW', 'Dortmund']]

In [38]:
df3=pd.DataFrame(city3)

In [39]:
df3

         0         1
0  Bavaria  Erlangen
1      NRW  Dortmund

In [40]:
df4=pd.DataFrame(city3,columns=['state','city'])

In [41]:
df4

     state      city
0  Bavaria  Erlangen
1      NRW  Dortmund

In [42]:
#dictionary to conver dataFrame 
dict1={
    'city1':city,
    'city2':city2
}

In [43]:
dict1

{'city1': ['Berlin', 'munich', 'studgratt'],
 'city2': ['Dortmund', 'paris', 'Postdam']}

In [44]:
type(dict1)

dict

In [45]:
df5=pd.DataFrame(dict1)

In [46]:
df5

       city1     city2
0     Berlin  Dortmund
1     munich     paris
2  studgratt   Postdam